// Level 80:
// შექმენით 3 ცვლადი, რომელიც არის let - ით შექმნილი და მიანიჭეთ მნიშვნელობები.

let name1 = "Nika"
let lastname1 = "Giorgadze"
let age1 = "3"

// შექმენით 3 ცვლადი, რომელიც არის const - ით შექმნილი და მიანიჭეთ მნიშვნელობები.

const name2 = "Nika"
const lastname2 = "Giorgadze"
const age2 = "3"

// 3, ახსენით კომენტარებით თუ რა არის let

// let - არის keyword რომელიც გამოიყენება ცვლადის შესაქმნელად.

// ახსენით კომენტარებით თუ რა არის const

// const - არის keyword რომელიც გამოიყენება ცვლადის შესაქმნელად.

// ახსენით კომენტარებით თუ რა განსხვავებაა let - სა და const - ს შორის.

// ამ ორ keyword - ს შორის განსხვავება არის ის, რომ let - ი ქნის ისეთ ცვლადებს, რომლის მნიშვნელობის შეცვლაც შესაძლებელია, ხოლო const - ქმნის ისეთ ცვლადებს, რომლის მნიშვნელობის შეცვლა შეუძლებელია.


