# 1)გააკეთეთ ხუთ ხუთი მაგალითი ყველა გავლილ მათემატიკურ ოპერატორზე.

# 2)შექმენით ცვლადი age და მნიშვნელობად გადაეცით თქვენი ასაკი, შექმენით ახალი ცვლადი სადაც იქნება თქვენი ასაკი 5 წლის შემდეგ, ბოლოს კი გამოიტანეთ ეს ცვლადი.

# 3)თქვენი ოჯახის წევრების ასაკები შეინახეთ ცვლადებში და დაითვალეთ ყველა ასაკის ჯამი.

# 4)შექმენით ცვლადი name რომელშიც შეინახავთ თქვენ სახელს და შემდეგ განაახლეთ ამ ცვლადის მნიშვნელობა და ჩაწერეთ თქვენი მეგობრის სახელი, საბოლოოდ დაბეჭდეთ name ცვლადი
# თუ რამეს ვერ გაიგებ ვოისის ჩათში დეტალურად არის ახსნილი ყველაფერი ახლის მნიშვნელობა რაც ახლა ისწავლე

# print(5 + 7) #მათემატიკური ოპერაციების შესრულება სტრინგში შეუძლებელია!
# print(15 + 3)
# print(6 + 7)
# print(18 + 27)
# print(105 + 250)

# print(5 - 7) 
# print(15 - 3)
# print(6 - 7)
# print(18 - 27)
# print(105 - 250)

# print(5 / 7) 
# print(15 / 3)
# print(6 / 7)
# print(18 / 27)
# print(105 / 250) #გაყოფა ყოველთვის აბრუნებს float - წილად რიცხვებს.

# print(5 * 7) 
# print(15 * 3)
# print(6 * 7)
# print(18 * 27)
# print(105 * 250)


# 2)შექმენით ცვლადი age და მნიშვნელობად გადაეცით თქვენი ასაკი, შექმენით ახალი ცვლადი სადაც იქნება თქვენი ასაკი 5 წლის შემდეგ, ბოლოს კი გამოიტანეთ ეს ცვლადი.

# age = 14
# age = 14 + 5
# print(age)

# # 3)თქვენი ოჯახის წევრების ასაკები შეინახეთ ცვლადებში და დაითვალეთ ყველა ასაკის ჯამი.

# my_age = 14
# mother_age = 39 
# my_sister_age = 10
# my_father_age = 40
# second_sister_age = 12
# print(my_age + mother_age + my_sister_age + second_sister_age + my_father_age)

# 4)შექმენით ცვლადი name რომელშიც შეინახავთ თქვენ სახელს და შემდეგ განაახლეთ ამ ცვლადის მნიშვნელობა და ჩაწერეთ თქვენი მეგობრის სახელი, საბოლოოდ დაბეჭდეთ name ცვლადი

# name = "Nikolozi" 
# name = "Cotne"
# print(name)

