// 1-დან 10-მდე რიცხვების ჯამი
// დავალება:
// შექმენით for loop, რომელიც გამოთვლის 1- დან 10 -მდე რიცხვების ჯამს, საბოლოო შედეგი გამოიტანეთ console - ში.
// შედეგი უნდა გამოიყურებოდეს შემდეგნაირად:⬇️
// 'საბოლოო რიცხვების ჯამი არის X'

let x = 0
for(let i = 1; i <= 10; i++){
    x += i
}

console.log(x)

// რიცხვების კვადრატი
// დავალება:
// შექმენით  for loop, რომელიც ამობეჭდავს 1-დან 10-მდე თითოეული რიცხვის კვადრატს.
// შედეგი უნდა გამოიყურებოდეს შემდეგნაირად:⬇️
// 'X - ის კვადრატი არის X'

for(let i = 1; i <= 10; i++){
    console.log(`${i}'s Square is ${i * i}`)
}


// სტრინგის თითოეული ასოს დაბეჭდვა
// დავალება:
// შექმენით string ტიპის ცვლადი, მაგალითად "გამარჯობა", და for loop-ის გამოყენებით ამობეჭდეთ მისი თითოეული ასო.
// გამოიყენეთ length.

let greet = "Hello"

for(let i = greet.length; i >= 0; i--){
    console.log(greet[i])
}

// FizzBuzz
// შექმენით FizzBuzz პროგრამა, რომელიც მუშაობს შემდეგნაირად⬇️
// თუ რიცხვი უნაშთოდ იყოფა 3-ზე, დაიბეჭდოს "Fizz".
// თუ რიცხვი უნაშთოდ იყოფა 5-ზე, დაიბეჭდოს "Buzz".
// თუ რიცხვი უნაშთოდ იყოფა ორივე (3-ზეც და 5-ზეც), დაიბეჭდოს "FizzBuzz".
// თუ არცერთი პირობა არ შესრულდება, დაიბეჭდოს თავად რიცხვი

for(let i = 0; i < 100; i++){
    if(i % 3 === 0 && i % 5 === 0){
        console.log("FizzBuzz")
    } else if(i % 3 === 0){
        console.log("Fizz")
    } else if(i % 5 === 0){
        console.log("Buzz")
    } else {    
        console.log(i)
    }        
}